Revit 2024 API
DistributionSysType.ElectricalPhaseConfiguration Property
 Get or set electrical phase configuration (Y, delta or undefined) of distribution system.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElectricalPhaseConfiguration ElectricalPhaseConfiguration { get; set; }
Visual Basic
Public Property ElectricalPhaseConfiguration As ElectricalPhaseConfiguration
	Get
	Set
Visual C++
public:
property ElectricalPhaseConfiguration ElectricalPhaseConfiguration {
	ElectricalPhaseConfiguration get ();
	void set (ElectricalPhaseConfiguration value);
}
See Also
DistributionSysType Class
Autodesk.Revit.DB.Electrical Namespace